/*В ночной клуб приходят мальчики и девочки.
 Каждый персонаж, пришедший в ночной клуб, может обладать разными навыками танцевать под разную музыку.
  Когда играет Rnb на танцполе танцуют те, кто танцуют хип-хоп, рнб.
   Когда играет Electrohuse на танцполе танцуют те, кто танцуют Electrodance.
    Когда играет Поп-музыка танцуют те кто умеют танцевать под поп-музыку.
     Если человек не умеет танцевать под данную музыку, он идет в бар и пьет водку.
      Необходимо эмулировать ночной клуб с произвольным количеством разных персонажей.
       В то время, когда они слышат музыку, персонажи должны соответствующим образом себя вести:
            танцевать или пить водку в баре.
Поведение персонажей следует выводить на экран текстом.
Музыка меняется в клубе каждые 5 секунд автоматически.*/

public class Main {
    private static Club club = new Club();


    public static void main(String[] args) throws InterruptedException {
        club.letsDance();
    }

}
